# ДЗ на пятницу:
# 1. Определить, является ли введенный год високосным
# 3 условия: деление на 4, на 100, на 400.
#year = int(input("Введите год: "))
#if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
#    print("YES")
#else:
#    print("NO")

# 2. Определить, существует ли треугольник с заданными тремя сторонами.
# Каждая сторона меньше суммы двух других
#stor_1 = float(input())
#stor_2 = float(input())
#stor_3 = float(input())
#if stor_1 + stor_2 > stor_3 and stor_1 + stor_3 > stor_2 and stor_2 + stor_3 > stor_1:
#    print("Треугольник существует")
#else:
#    print("Треугольник не существует")

# 3. Определить, принадлежит ли точка кругу. Ввести координаты точки и радиус круга.
# По формуле пифагора можно вычислить, расстояние от центра круга до точки.
#x = 5
#y = 10
#r = 3 #радиус круга
#Используем теорему Пифагора
#if x**2+y**2 > r**2: print('Точка лежит снаружи')
#else: print('Точка внутри')
